heating_source/constant/fluid/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/fluid/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          200;
        startFace       76520;
    }
    outlet
    {
        type            patch;
        nFaces          200;
        startFace       76720;
    }
    fixedWalls
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          400;
        startFace       76920;
    }
    frontAndBack
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          77000;
        startFace       77320;
    }
    fluid_to_metal
    {
        type            mappedWall;
        inGroups        List<word> 1(wall);
        nFaces          160;
        startFace       154320;
        sampleMode      nearestPatchFace;
        sampleRegion    metal;
        samplePatch     metal_to_fluid;
    }
)

// ************************************************************************* //
