heating_source/constant/heater/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/heater/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

2
(
    frontAndBack
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          800;
        startFace       760;
    }
    heater_to_metal
    {
        type            mappedWall;
        inGroups        List<word> 1(wall);
        nFaces          80;
        startFace       1560;
        sampleMode      nearestPatchFace;
        sampleRegion    metal;
        samplePatch     metal_to_heater;
    }
)

// ************************************************************************* //
