heating_source/constant/metal/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/metal/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    frontAndBack
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          2200;
        startFace       2080;
    }
    metal_to_fluid
    {
        type            mappedWall;
        inGroups        List<word> 1(wall);
        nFaces          160;
        startFace       4280;
        sampleMode      nearestPatchFace;
        sampleRegion    fluid;
        samplePatch     fluid_to_metal;
    }
    metal_to_heater
    {
        type            mappedWall;
        inGroups        List<word> 1(wall);
        nFaces          80;
        startFace       4440;
        sampleMode      nearestPatchFace;
        sampleRegion    heater;
        samplePatch     heater_to_metal;
    }
)

// ************************************************************************* //
