heating_source/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
//Define Heater Patch
    {
        name    c0;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
            box (-0.01 -0.01 0) (0.01 0.01 0.01); 
        }
    }
    
        {
        name    heater;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        sourceInfo
        {
            set c0; 
        }
    }
 
 //Define Metal Patch   
      {
        name    c1;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
            box (-0.025 -0.015 0) (0.025 0.015 0.01); 
        }
    }
    
    
    
    {
        name    c1;
        type    cellSet;
        action  delete;
        source  boxToCell;
        sourceInfo
        {
            box (-0.01 -0.01 0) (0.01 0.01 0.01); 
        }
    }
    
    
    
    
        {
        name    metal;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        sourceInfo
        {
            set c1; 
        }
    }
    
//Define Fluid Patch

      {
        name    c2;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
            box (-0.1 -0.1 0) (0.1 0.1 0.01); 
        }
    }
    
    
    
    {
        name    c2;
        type    cellSet;
        action  delete;
        source  boxToCell;
        sourceInfo
        {
            box (-0.025 -0.015 0) (0.025 0.015 0.01); 
        }
    }
    
    
    
    
        {
        name    fluid;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        sourceInfo
        {
            set c2; 
        }
    }






      
    
    
);

// ************************************************************************* //
